{
"totalArticles": 35790,
"articles": [
{
"title": "Ukraine-Russia War Live News: Latest Updates",
"description": "Continued shelling by Russian forces endangered efforts to evacuate civilians from the besieged city of Mariupol, Ukrainian military officials said. President Volodymyr Zelensky repeated his calls for NATO to enforce a no-fly zone over his country.",
"content": "[Warning: This post includes an image of graphic violence.]\nIRPIN, Ukraine — A Russian force advancing on Kyiv fired mortar shells on Sunday at a battered bridge used by evacuees fleeing the fighting, sending panicked civilians running, kicking up a ... [2919 chars]",
"url": "https://www.nytimes.com/live/2022/03/06/world/ukraine-russia",
"image": "https://static01.nyt.com/images/2022/03/06/multimedia/06ukraine-blog-promo1245GMT/06ukraine-blog-promo1245GMT-facebookJumbo.jpg",
"publishedAt": "2022-03-06T13:08:21Z",
"source": {
"name": "The New York Times",
"url": "https://www.nytimes.com"
}
},
{
"title": "Besieged Ukraine port city Mariupol begins new evacuation bid",
"description": "KYIV - Ukraine's besieged port city of Mariupol began a new attempt at evacuating civilians on Sunday, as fierce battles raged around the country and the Ukrainian president warned that Russian forces were preparing to bombard Odessa on the Black Sea coast.",
"content": "KYIV – Ukraine’s besieged port city of Mariupol began a new attempt at evacuating civilians on Sunday, as fierce battles raged around the country and the Ukrainian president warned that Russian forces were preparing to bombard Odessa on the Black Sea... [6770 chars]",
"url": "https://www.bolnews.com/latest/2022/03/besieged-ukraine-port-city-mariupol-begins-new-evacuation-bid/",
"image": "https://bolnews.s3.amazonaws.com/wp-content/uploads/2022/03/download-6.jpg",
"publishedAt": "2022-03-06T13:06:47Z",
"source": {
"name": "BOL News",
"url": "https://www.bolnews.com"
}
},
{
"title": "Ukraine invasion: What life is like as Russian forces close in on capital Kyiv",
"description": "Anastasiia Kryshka says she hasn't left her house in 10 days, and said not knowing where the Russians will shoot next is the most terrifying part.",
"content": "A Kyiv resident has told Sky News her biggest fear as Russian forces close in on the capital is waking up every day \"not knowing if she'll make it or not\".\nWhen Anastasiia Kryshka arrived back in her hometown after finishing her degree in the UK, she... [2920 chars]",
"url": "https://news.sky.com/story/ukraine-invasion-what-life-is-like-as-russian-forces-close-in-on-capital-kyiv-12559071",
"image": "https://e3.365dm.com/22/03/1600x900/skynews-anastasiia-kryshka_5696293.jpg?20220306130538",
"publishedAt": "2022-03-06T13:06:00Z",
"source": {
"name": "Sky News",
"url": "https://news.sky.com"
}
},
{
"title": "Ukraine Crisis: Aviation Ministry Says 8 Flights to Bring Back Over 1,500 Indians on Monday",
"description": "The Ukrainian airspace has been shut since February 24 due to the Russian military offensive. Indian citizens fleeing Ukraine are being airlifted from its neighbours such as Romania, Hungary, Slovakia and Poland.",
"content": "Eight flights with over 1,500 Indians will operate from war-torn Ukraine’s neighbouring countries to India on Monday, the Civil Aviation Ministry stated on Sunday. The Ukrainian airspace has been shut since February 24 due to the Russian military off... [938 chars]",
"url": "https://www.news18.com/news/india/ukraine-crisis-aviation-ministry-says-8-flights-to-bring-back-over-1500-indians-on-monday-4843640.html",
"image": "https://images.news18.com/ibnlive/uploads/2022/03/op-ganga-pic-twitter-1-164622919116x9.jpg",
"publishedAt": "2022-03-06T13:05:32Z",
"source": {
"name": "News18",
"url": "https://www.news18.com"
}
},
{
"title": "War in Ukraine: Indian Air Force Evacuation Flight with 210 Indians Lands in Delhi",
"description": "Eleven more special flights are expected to operate on Sunday from Budapest, Kosice, Rzeszow and Bucharest, to bring in more than 2,200 Indians back home.",
"content": "The Indian Air Force has evacuated 210 more Indian nationals who were stranded in the crisis-hit Ukraine. “An IAF flight carrying 210 Indians from Bucharest, Romania has landed at Hindan airbase near Delhi in the early hours of Sunday,\" an official s... [1552 chars]",
"url": "https://www.news18.com/news/auto/war-in-ukraine-indian-air-force-evacuation-flight-with-210-indians-lands-in-delhi-4841720.html",
"image": "https://images.news18.com/ibnlive/uploads/2022/03/air-india-express-evacuation-flight-164614521916x9.jpg",
"publishedAt": "2022-03-06T12:59:33Z",
"source": {
"name": "News18",
"url": "https://www.news18.com"
}
},
{
"title": "Israeli PM vows more Ukraine talks, even if prospects 'not great'",
"description": "JERUSALEM - Israel's premier said Sunday his country had a \"moral obligation\" to help stem fighting in Ukraine even if chances of success were \"not great\", after shuttle diplomacy that saw him visit the Kremlin.",
"content": "JERUSALEM – Israel’s premier said Sunday his country had a “moral obligation” to help stem fighting in Ukraine even if chances of success were “not great”, after shuttle diplomacy that saw him visit the Kremlin.\nPrime Minister Naftali Bennett met for... [2409 chars]",
"url": "https://www.bolnews.com/latest/2022/03/israeli-pm-vows-more-ukraine-talks-even-if-prospects-not-great/",
"image": "https://bolnews.s3.amazonaws.com/wp-content/uploads/2022/03/download-5.jpg",
"publishedAt": "2022-03-06T12:57:22Z",
"source": {
"name": "BOL News",
"url": "https://www.bolnews.com"
}
},
{
"title": "Ukraine invasion: Civilians cower on the ground with shells exploding overhead as they flee Russian assault",
"description": "Ukraine has been defending itself from more Russian attacks as Putin's invasion continues into another week.",
"content": "Video has emerged of people in Ukraine running for their lives and throwing themselves to the ground as shells explode over their heads in the town of Irpin.\nUkrainian President Volodymyr Zelenskyy said Russia has just targeted the city of Vinnytsya ... [4322 chars]",
"url": "https://news.sky.com/story/ukraine-invasion-civilians-cower-on-the-ground-with-shells-exploding-overhead-as-they-flee-russian-assault-12559054",
"image": "https://e3.365dm.com/22/03/1600x900/skynews-ukraine-irpin-shelling_5696224.jpg?20220306113903",
"publishedAt": "2022-03-06T12:50:00Z",
"source": {
"name": "Sky News",
"url": "https://news.sky.com"
}
},
{
"title": "Russian soldiers get lost and knock on Ukraine village doors for food",
"description": "Russia's military has reportedly experienced command and control issues and tanks have become stuck in the mud",
"content": "Something went wrong, please try again later.\nGet the stories that matter to our community straight to your inbox with our Daily Newsletter\nWhen Russia's invasion of Ukraine began on February 24, there were fears the nation would only be able to hold... [6704 chars]",
"url": "https://www.plymouthherald.co.uk/news/uk-world-news/russian-soldiers-lost-knock-ukraine-6761337",
"image": "https://i2-prod.hulldailymail.co.uk/incoming/article6744868.ece/ALTERNATES/s1200/1_UKRAINE_Russia_232538.jpg",
"publishedAt": "2022-03-06T12:37:47Z",
"source": {
"name": "Plymouth Live",
"url": "https://www.plymouthherald.co.uk"
}
},
{
"title": "Russian soldiers get lost and knock on Ukraine village doors for food",
"description": "Russia's military has reportedly experienced command and control issues and tanks have become stuck in the mud",
"content": "Something went wrong, please try again later.\nOur free email updates are the best way to get headlines direct to your inbox\nWhen Russia's invasion of Ukraine began on February 24, there were fears the nation would only be able to hold out for a few d... [6688 chars]",
"url": "https://www.nottinghampost.com/news/uk-world-news/russian-soldiers-lost-knock-ukraine-6761337",
"image": "https://i2-prod.hulldailymail.co.uk/incoming/article6744868.ece/ALTERNATES/s1200/1_UKRAINE_Russia_232538.jpg",
"publishedAt": "2022-03-06T12:37:47Z",
"source": {
"name": "Nottinghamshire Live",
"url": "https://www.nottinghampost.com"
}
},
{
"title": "Russia's Putin calls on Ukraine to stop fighting",
"description": "President Vladimir Putin warned Ukraine on Sunday that Russia's military operation would only be halted if Kyiv stopped resisting and fulfilled all of the Kremlin's demands. Putin told Turkish President Tayyip Erdogan by telephone that Ukraine's negotiators should take a more \"constructive\" approach at talks with Moscow to take into account the reality on the ground.",
"content": "President Vladimir Putin warned Ukraine on Sunday that Russia's military operation would only be halted if Kyiv stopped resisting and fulfilled all of the Kremlin's demands.\nPutin told Turkish President Tayyip Erdogan by telephone that Ukraine's nego... [1392 chars]",
"url": "https://www.devdiscourse.com/article/law-order/1951107-russias-putin-calls-on-ukraine-to-stop-fighting",
"image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/05_03_2022_14_39_22_0005565.jpg?width=920&format=jpeg",
"publishedAt": "2022-03-06T12:36:36Z",
"source": {
"name": "Devdiscourse",
"url": "https://www.devdiscourse.com"
}
}
]
}
